Revit 2026 API

# ApplicationNewPointRelativeToPoint Method

---

Create a PointRelativeToPoint object, which is used to define the placement of a ReferencePoint relative to a host point.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointRelativeToPoint NewPointRelativeToPoint(
	Reference hostPointReference
)
```
```vb
Public Function NewPointRelativeToPoint (
	hostPointReference As Reference
) As PointRelativeToPoint
```
```cpp
public:
PointRelativeToPoint^ NewPointRelativeToPoint(
	Reference^ hostPointReference
)
```
```fsharp
member NewPointRelativeToPoint :
        hostPointReference : Reference -> PointRelativeToPoint
```

#### Parameters

hostPointReference Reference
    The reference of the host point.

#### Return Value

PointRelativeToPointIf creation is successful then a new PointRelativeToPoint object is returned, otherwise an exception with failure information will be thrown.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument hostPointReference is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace